app/controllers/products_controller.rb

def new
  @product = Product.new
  @categories = Category.all.map{|c| [ c.name, c.id ] }
---
SELECT "categories".* FROM "categories"