app/views/products/index.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

        <p><%= link_to Category.find(product.category_id).name, category_path(product.category_id) %></p>